In [1]:
from selenium import webdriver
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
path=r"C:\Users\Mini\Downloads\chromedriver_win32\chromedriver.exe"

In [3]:
driver= webdriver.Chrome(path)

In [4]:
driver.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')

In [5]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('span',attrs={'class':'u-show-phablet'})
print(len(names))
matches=soup.findAll('td',attrs={'class':'rankings-block__banner--matches'})
print(len(matches))
points=soup.findAll('td',attrs={'class':'rankings-block__banner--points'})
print(len(points))
rating=soup.findAll('td',attrs={'class':'rankings-block__banner--rating u-text-right'})
print(len(rating))

15
1
1
1

In [6]:
names

[<span class="u-show-phablet">AUS</span>,
 <span class="u-show-phablet">SA</span>,
 <span class="u-show-phablet">ENG</span>,
 <span class="u-show-phablet">IND</span>,
 <span class="u-show-phablet">NZ</span>,
 <span class="u-show-phablet">WI</span>,
 <span class="u-show-phablet">PAK</span>,
 <span class="u-show-phablet">BAN</span>,
 <span class="u-show-phablet">SL</span>,
 <span class="u-show-phablet">IRE</span>,
 <span class="icn icn-facebook-circle-small u-show-phablet"></span>,
 <span class="icn icn-twitter-circle-small u-show-phablet"></span>,
 <span class="icn icn-instagram-circle-small u-show-phablet"></span>,
 <span class="icn icn-youtube-circle-small u-show-phablet"></span>,
 <span class="icn icn-tiktok-circle-small u-show-phablet"></span>]

In [7]:
Names=[]
Matches=[]
Matches1=[]
Points=[]
Points1=[]
Rating=[]
Rating1=[]

In [8]:
for i in names:
    Names.append(i.text)
Names

['AUS',
 'SA',
 'ENG',
 'IND',
 'NZ',
 'WI',
 'PAK',
 'BAN',
 'SL',
 'IRE',
 '',
 '',
 '',
 '',
 '']

In [9]:
df=pd.DataFrame(Names)
df=df.rename({0:'Team'},axis=1)
df=df.iloc[0:10]
df

  Team
0  AUS
1   SA
2  ENG
3  IND
4   NZ
5   WI
6  PAK
7  BAN
8   SL
9  IRE

In [10]:
for i in matches:
    Matches.append(i.text)
Matches

['18']

In [11]:
df1=pd.DataFrame(Matches)
df1=df1.rename({0:'Matches'},axis=1)
df1

  Matches
0      18

In [12]:
for i in points:
    Points.append(i.text)
Points

['2,955']

In [13]:
df2=pd.DataFrame(Points)
df2=df2.rename({0:'Points'},axis=1)
df2

  Points
0  2,955

In [14]:
for i in rating:
    Rating.append(i.text)
Rating

['\n                            164\n                            \n\n']

In [15]:
df3=pd.DataFrame(Rating)
df3=df3.rename({0:'Rating'},axis=1)
df3=df3['Rating'].str.split('\n').str[1]
df3

0                                164
Name: Rating, dtype: object

In [16]:
df4=pd.DataFrame(df3)
df4

                            Rating
0                              164

In [17]:
Aus=pd.concat([df1,df2,df4],axis=1)
Aus

  Matches Points                           Rating
0      18  2,955                              164

In [18]:
content=driver.page_source
soup= BeautifulSoup(content)

In [23]:
content=driver.page_source
soup= BeautifulSoup(content)

matches1=soup.findAll('td',attrs={'class':'table-body__cell u-center-text'})
print(len(matches1))
points1=soup.findAll('td',attrs={'class':'table-body__cell u-center-text'})
print(len(points1))
rating1=soup.findAll('td',attrs={'class':'table-body__cell u-text-right rating'})
print(len(rating1))

18
18
9

In [24]:
matches1

[<td class="table-body__cell u-center-text">24</td>,
 <td class="table-body__cell u-center-text">2,828</td>,
 <td class="table-body__cell u-center-text">17</td>,
 <td class="table-body__cell u-center-text">1,993</td>,
 <td class="table-body__cell u-center-text">20</td>,
 <td class="table-body__cell u-center-text">2,226</td>,
 <td class="table-body__cell u-center-text">21</td>,
 <td class="table-body__cell u-center-text">1,947</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">1,025</td>,
 <td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,101</td>,
 <td class="table-body__cell u-center-text">5</td>,
 <td class="table-body__cell u-center-text">306</td>,
 <td class="table-body__cell u-center-text">11</td>,
 <td class="table-body__cell u-center-text">519</td>,
 <td class="table-body__cell u-center-text">2</td>,
 <td class="table-body__cell u-center-text">25</td>]

In [25]:
points1

[<td class="table-body__cell u-center-text">24</td>,
 <td class="table-body__cell u-center-text">2,828</td>,
 <td class="table-body__cell u-center-text">17</td>,
 <td class="table-body__cell u-center-text">1,993</td>,
 <td class="table-body__cell u-center-text">20</td>,
 <td class="table-body__cell u-center-text">2,226</td>,
 <td class="table-body__cell u-center-text">21</td>,
 <td class="table-body__cell u-center-text">1,947</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">1,025</td>,
 <td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,101</td>,
 <td class="table-body__cell u-center-text">5</td>,
 <td class="table-body__cell u-center-text">306</td>,
 <td class="table-body__cell u-center-text">11</td>,
 <td class="table-body__cell u-center-text">519</td>,
 <td class="table-body__cell u-center-text">2</td>,
 <td class="table-body__cell u-center-text">25</td>]

In [26]:
for i in matches1:
    Matches1.append(i.text)
Matches1

['24',
 '2,828',
 '17',
 '1,993',
 '20',
 '2,226',
 '21',
 '1,947',
 '12',
 '1,025',
 '15',
 '1,101',
 '5',
 '306',
 '11',
 '519',
 '2',
 '25']

In [27]:
df5=pd.DataFrame(Matches1)
df6=df5.iloc[0:18:2]
df6.index=range(9)
df6=df6.rename({0: 'Matches'},axis=1)
df6=df6.iloc[0:9]
df6

  Matches
0      24
1      17
2      20
3      21
4      12
5      15
6       5
7      11
8       2

In [28]:
for i in points1:
    Points1.append(i.text)
Points1

['24',
 '2,828',
 '17',
 '1,993',
 '20',
 '2,226',
 '21',
 '1,947',
 '12',
 '1,025',
 '15',
 '1,101',
 '5',
 '306',
 '11',
 '519',
 '2',
 '25']

In [29]:
df7=pd.DataFrame(Points1)
df8=df7.iloc[1:18:2]
df8.index=range(9)
df8=df8.rename({0: 'Points'},axis=1)
df8=df8.iloc[0:9]
df8

  Points
0  2,828
1  1,993
2  2,226
3  1,947
4  1,025
5  1,101
6    306
7    519
8     25

In [30]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['118', '117', '111', '93', '85', '73', '61', '47', '13']

In [31]:
df9=pd.DataFrame(Rating1)
df9=df9.rename({0:'Rating'},axis=1)
df9

  Rating
0    118
1    117
2    111
3     93
4     85
5     73
6     61
7     47
8     13

In [32]:
ODI=pd.concat([df6,df8,df9],axis=1)
ODI

  Matches Points Rating
0      24  2,828    118
1      17  1,993    117
2      20  2,226    111
3      21  1,947     93
4      12  1,025     85
5      15  1,101     73
6       5    306     61
7      11    519     47
8       2     25     13

In [33]:
ODI1=pd.concat([Aus,ODI],axis=0)
ODI1.index=range(10)
ODI1

  Matches Points                           Rating
0      18  2,955                              164
1      24  2,828                              118
2      17  1,993                              117
3      20  2,226                              111
4      21  1,947                               93
5      12  1,025                               85
6      15  1,101                               73
7       5    306                               61
8      11    519                               47
9       2     25                               13

In [34]:
Womens_ODI=pd.concat([df,ODI1],axis=1)
Womens_ODI

  Team Matches Points                           Rating
0  AUS      18  2,955                              164
1   SA      24  2,828                              118
2  ENG      17  1,993                              117
3  IND      20  2,226                              111
4   NZ      21  1,947                               93
5   WI      12  1,025                               85
6  PAK      15  1,101                               73
7  BAN       5    306                               61
8   SL      11    519                               47
9  IRE       2     25                               13

# Top 10 womenâ€™s ODI players along with the records of their team and rating

In [35]:
path=r"C:\Users\Mini\Downloads\chromedriver_win32\chromedriver.exe"

In [36]:
driver = webdriver.Chrome(path)

In [37]:
driver.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')

In [38]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('div',attrs={'class':'rankings-block__banner--name-large'})
print(len(names))
team=soup.findAll('div',attrs={'class':'rankings-block__banner--nationality'})
print(len(team))
rating=soup.findAll('div',attrs={'class':'rankings-block__banner--rating'})
print(len(rating))

1
1
1

In [39]:
Names=[]
Names1=[]
Team=[]
Team1=[]
Rating=[]
Rating1=[]

In [40]:
for i in names:
    Names.append(i.text)
Names

['Tammy Beaumont']

In [41]:
df10=pd.DataFrame(Names)
df11=df10.rename({0:'Batsman Name'},axis=1)
df11

     Batsman Name
0  Tammy Beaumont

In [42]:
for i in team:
    Team.append(i.text)
Team

['\n\nENG\n                    ']

In [43]:
df12=pd.DataFrame(Team)
df12[0] =df12[0].str.replace('\n',' ')
df12=df12.rename({0:'Team'},axis=1)
df12

                         Team
0    ENG

In [44]:
for i in rating:
    Rating.append(i.text)
Rating

['765']

In [45]:
df13=pd.DataFrame(Rating)
df13=df13.rename({0:'Rating'},axis=1)
df13

  Rating
0    765

In [46]:
player=pd.concat([df11,df12,df13],axis=1)
player

     Batsman Name                        Team Rating
0  Tammy Beaumont    ENG                         765

In [47]:
names1=soup.findAll('td',attrs={'class':'table-body__cell rankings-table__name name'})
print(len(names1))
team1=soup.findAll('td',attrs={'class':'table-body__cell nationality-logo rankings-table__team'})
print(len(team1))
rating1=soup.findAll('td',attrs={'table-body__cell rating'})
print(len(rating1))

99
99
99

In [48]:
for i in names1:
    Names1.append(i.text)
Names1

['\nLizelle Lee\n',
 '\nAlyssa Healy\n',
 '\nStafanie Taylor\n',
 '\nMeg Lanning\n',
 '\nAmy Satterthwaite\n',
 '\nSmriti Mandhana\n',
 '\nMithali Raj\n',
 '\nNatalie Sciver\n',
 '\nLaura Wolvaardt\n',
 '\nEllyse Perry\n',
 '\nChamari Athapaththu\n',
 '\nHeather Knight\n',
 '\nRachael Haynes\n',
 '\nHarmanpreet Kaur\n',
 '\nMignon du Preez\n',
 '\nBeth Mooney\n',
 '\nPoonam Raut\n',
 '\nSuzie Bates\n',
 '\nSophie Devine\n',
 '\nDeepti Sharma\n',
 '\nMarizanne Kapp\n',
 '\nNahida Khan\n',
 '\nAmy Jones\n',
 '\nJaveria Khan\n',
 '\nBismah Maroof\n',
 '\nDane van Niekerk\n',
 '\nHayley Matthews\n',
 '\nNicole Bolton\n',
 '\nFargana Hoque\n',
 '\nAshleigh Gardner\n',
 '\nRumana Ahmed\n',
 '\nChloe-Lesleigh Tryon\n',
 '\nKatie Perkins\n',
 '\nAliya Riaz\n',
 '\nDanielle Wyatt\n',
 '\nSune Luus\n',
 '\nAmelia Kerr\n',
 '\nJess Jonassen\n',
 '\nKatherine Brunt\n',
 '\nNida Dar\n',
 '\nTrisha Chetty\n',
 '\nKatey Martin\n',
 '\nHarshitha Madavi\n',
 '\nBrooke Halliday\n',
 '\nFran Wilson\n',
 '\nJemimah Rodriques\n',
 '\nShikha Pandey\n',
 '\nMaddie Green\n',
 '\nShemaine Campbelle\n',
 '\nDilani Manodara\n',
 '\nNigar Sultana\n',
 '\nUmaima Sohail\n',
 '\nPriya Punia\n',
 '\nLara Goodall\n',
 '\nLauren Winfield\n',
 '\nJhulan Goswami\n',
 '\nChedean Nation\n',
 '\nRachel Priest\n',
 '\nKyshona Knight\n',
 '\nKycia Knight\n',
 '\nLauren Down\n',
 '\nSidra Ameen\n',
 '\nNilakshi Silva\n',
 '\nNicola Carey\n',
 '\nHayley Jensen\n',
 '\nSheneta Grimmond\n',
 '\nSalma Khatun\n',
 '\nTaniya Bhatia\n',
 '\nGeorgia Wareham\n',
 '\nPoonam Yadav\n',
 '\nAnne Bosch\n',
 '\nAndrie Steyn\n',
 '\nAvanthika Mendis\n',
 '\nAnya Shrubsole\n',
 '\nNatasha McLean\n',
 '\nSharmin Supta\n',
 '\nRajeshwari Gayakwad\n',
 '\nLeigh Kasperek\n',
 '\nAnushka Sanjeewani\n',
 '\nKate Cross\n',
 '\nInoka Ranaweera\n',
 '\nLea Tahuhu\n',
 '\nStacy-Ann King\n',
 '\nMegan Schutt\n',
 '\nOshadi Ranasinghe\n',
 '\nNashra Sandhu\n',
 '\nSushma Verma\n',
 '\nChinelle Henry\n',
 '\nShamilia Connell\n',
 '\nSanjida Islam\n',
 '\nJess Kerr\n',
 '\nHannah Rowe\n',
 '\nShabnim Ismail\n',
 '\nAfy Fletcher\n',
 '\nSophie Ecclestone\n',
 '\nDiana Baig\n',
 '\nSidra Nawaz\n',
 '\nPanna Ghosh\n',
 '\nAma Kanchana\n']

In [49]:
df14=pd.DataFrame(Names1)
df14[0] =df14[0].str.replace('\n',' ')
df14=df14.rename({0:'Batsman Name'},axis=1)
df14=df14.iloc[0:9]
df14

          Batsman Name
0         Lizelle Lee
1        Alyssa Healy
2     Stafanie Taylor
3         Meg Lanning
4   Amy Satterthwaite
5     Smriti Mandhana
6         Mithali Raj
7      Natalie Sciver
8     Laura Wolvaardt

In [50]:
for i in team1:
    Team1.append(i.text)

In [51]:
Team1

['\n\nSA\n',
 '\n\nAUS\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nAUS\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSL\n',
 '\n\nBAN\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nSL\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nBAN\n',
 '\n\nSL\n']

In [52]:
df15=pd.DataFrame(Team1)
df15[0] =df15[0].str.replace('\n',' ')
df15=df15.rename({0:'Team'},axis=1)
df15=df15.iloc[0:9]
df15

     Team
0     SA
1    AUS
2     WI
3    AUS
4     NZ
5    IND
6    IND
7    ENG
8     SA

In [53]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['758',
 '756',
 '746',
 '723',
 '715',
 '710',
 '709',
 '685',
 '683',
 '679',
 '667',
 '666',
 '657',
 '636',
 '620',
 '600',
 '593',
 '577',
 '573',
 '568',
 '560',
 '560',
 '536',
 '536',
 '520',
 '498',
 '461',
 '456',
 '445',
 '440',
 '437',
 '437',
 '413',
 '410',
 '404',
 '398',
 '396',
 '380',
 '361',
 '360',
 '359',
 '357',
 '353',
 '350',
 '341',
 '337',
 '335',
 '320',
 '319',
 '319',
 '317',
 '310',
 '305',
 '305',
 '302',
 '294',
 '292',
 '285',
 '281',
 '276',
 '264',
 '264',
 '261',
 '259',
 '256',
 '252',
 '244',
 '240',
 '239',
 '236',
 '234',
 '234',
 '226',
 '225',
 '224',
 '221',
 '220',
 '219',
 '211',
 '208',
 '205',
 '204',
 '201',
 '195',
 '195',
 '192',
 '190',
 '188',
 '186',
 '181',
 '179',
 '179',
 '178',
 '175',
 '172',
 '170',
 '168',
 '166',
 '161']

In [54]:
df16=pd.DataFrame(Rating1)
df16=df16.rename({0:'Rating'},axis=1)
df16=df16.iloc[0:9]
df16

  Rating
0    758
1    756
2    746
3    723
4    715
5    710
6    709
7    685
8    683

In [55]:
player1=pd.concat([df14,df15,df16],axis=1)
player1

          Batsman Name    Team Rating
0         Lizelle Lee      SA     758
1        Alyssa Healy     AUS     756
2     Stafanie Taylor      WI     746
3         Meg Lanning     AUS     723
4   Amy Satterthwaite      NZ     715
5     Smriti Mandhana     IND     710
6         Mithali Raj     IND     709
7      Natalie Sciver     ENG     685
8     Laura Wolvaardt      SA     683

In [56]:
ODI_Batsmen=pd.concat([player,player1],axis=0)
ODI_Batsmen.index=range(10)
ODI_Batsmen

          Batsman Name                        Team Rating
0       Tammy Beaumont    ENG                         765
1         Lizelle Lee                          SA     758
2        Alyssa Healy                         AUS     756
3     Stafanie Taylor                          WI     746
4         Meg Lanning                         AUS     723
5   Amy Satterthwaite                          NZ     715
6     Smriti Mandhana                         IND     710
7         Mithali Raj                         IND     709
8      Natalie Sciver                         ENG     685
9     Laura Wolvaardt                          SA     683

# Top 10 womenâ€™s ODI all-rounder along with the records of their team and rating

In [57]:
path=r"C:\Users\Mini\Downloads\chromedriver_win32\chromedriver.exe"

In [58]:
driver = webdriver.Chrome(path)

In [59]:
driver.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')

In [ ]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('div',attrs={'class':'rankings-block__banner--name-large'})
print(len(names))
team=soup.findAll('div',attrs={'class':'rankings-block__banner--nationality'})
print(len(team))
rating=soup.findAll('div',attrs={'class':'rankings-block__banner--rating'})
print(len(rating))

In [61]:
Names=[]
Names1=[]
Team=[]
Team=[]
Rating=[]
Rating1=[]

In [62]:
for i in names:
    Names.append(i.text)
Names

['Tammy Beaumont']

In [63]:
df17=pd.DataFrame(Names)
df17=df17.rename({0:'Player Name'},axis=1)
df17

      Player Name
0  Tammy Beaumont

In [64]:
for i in team:
    Team.append(i.text)
Team

['\n\nENG\n                    ']

In [65]:
df18=pd.DataFrame(Team)
df18[0]=df18[0].str.replace('\n',' ')
df18=df18.rename({0:'Team'},axis=1)
df18

                         Team
0    ENG

In [66]:
for i in rating:
    Rating.append(i.text)
Rating

['765']

In [67]:
df19=pd.DataFrame(Rating)
df19=df19.rename({0:'Rating'},axis=1)
df19

  Rating
0    765

In [68]:
player=pd.concat([df17,df18,df19],axis=1)
player

      Player Name                        Team Rating
0  Tammy Beaumont    ENG                         765

In [69]:
names1=soup.findAll('td',attrs={'class':'table-body__cell rankings-table__name name'})
print(len(names1))
team1=soup.findAll('td',attrs={'class':'table-body__cell nationality-logo rankings-table__team'})
print(len(team1))
rating1=soup.findAll('td',attrs={'class':'table-body__cell rating'})
print(len(rating1))

99
99
99

In [70]:
for i in names1:
    Names1.append(i.text)
Names1

['\nLizelle Lee\n',
 '\nAlyssa Healy\n',
 '\nStafanie Taylor\n',
 '\nMeg Lanning\n',
 '\nAmy Satterthwaite\n',
 '\nSmriti Mandhana\n',
 '\nMithali Raj\n',
 '\nNatalie Sciver\n',
 '\nLaura Wolvaardt\n',
 '\nEllyse Perry\n',
 '\nChamari Athapaththu\n',
 '\nHeather Knight\n',
 '\nRachael Haynes\n',
 '\nHarmanpreet Kaur\n',
 '\nMignon du Preez\n',
 '\nBeth Mooney\n',
 '\nPoonam Raut\n',
 '\nSuzie Bates\n',
 '\nSophie Devine\n',
 '\nDeepti Sharma\n',
 '\nMarizanne Kapp\n',
 '\nNahida Khan\n',
 '\nAmy Jones\n',
 '\nJaveria Khan\n',
 '\nBismah Maroof\n',
 '\nDane van Niekerk\n',
 '\nHayley Matthews\n',
 '\nNicole Bolton\n',
 '\nFargana Hoque\n',
 '\nAshleigh Gardner\n',
 '\nRumana Ahmed\n',
 '\nChloe-Lesleigh Tryon\n',
 '\nKatie Perkins\n',
 '\nAliya Riaz\n',
 '\nDanielle Wyatt\n',
 '\nSune Luus\n',
 '\nAmelia Kerr\n',
 '\nJess Jonassen\n',
 '\nKatherine Brunt\n',
 '\nNida Dar\n',
 '\nTrisha Chetty\n',
 '\nKatey Martin\n',
 '\nHarshitha Madavi\n',
 '\nBrooke Halliday\n',
 '\nFran Wilson\n',
 '\nJemimah Rodriques\n',
 '\nShikha Pandey\n',
 '\nMaddie Green\n',
 '\nShemaine Campbelle\n',
 '\nDilani Manodara\n',
 '\nNigar Sultana\n',
 '\nUmaima Sohail\n',
 '\nPriya Punia\n',
 '\nLara Goodall\n',
 '\nLauren Winfield\n',
 '\nJhulan Goswami\n',
 '\nChedean Nation\n',
 '\nRachel Priest\n',
 '\nKyshona Knight\n',
 '\nKycia Knight\n',
 '\nLauren Down\n',
 '\nSidra Ameen\n',
 '\nNilakshi Silva\n',
 '\nNicola Carey\n',
 '\nHayley Jensen\n',
 '\nSheneta Grimmond\n',
 '\nSalma Khatun\n',
 '\nTaniya Bhatia\n',
 '\nGeorgia Wareham\n',
 '\nPoonam Yadav\n',
 '\nAnne Bosch\n',
 '\nAndrie Steyn\n',
 '\nAvanthika Mendis\n',
 '\nAnya Shrubsole\n',
 '\nNatasha McLean\n',
 '\nSharmin Supta\n',
 '\nRajeshwari Gayakwad\n',
 '\nLeigh Kasperek\n',
 '\nAnushka Sanjeewani\n',
 '\nKate Cross\n',
 '\nInoka Ranaweera\n',
 '\nLea Tahuhu\n',
 '\nStacy-Ann King\n',
 '\nMegan Schutt\n',
 '\nOshadi Ranasinghe\n',
 '\nNashra Sandhu\n',
 '\nSushma Verma\n',
 '\nChinelle Henry\n',
 '\nShamilia Connell\n',
 '\nSanjida Islam\n',
 '\nJess Kerr\n',
 '\nHannah Rowe\n',
 '\nShabnim Ismail\n',
 '\nAfy Fletcher\n',
 '\nSophie Ecclestone\n',
 '\nDiana Baig\n',
 '\nSidra Nawaz\n',
 '\nPanna Ghosh\n',
 '\nAma Kanchana\n']

In [71]:
df20=pd.DataFrame(Names1)
df20[0]=df20[0].str.replace('\n',' ')
df20=df20.rename({0:'Player Name'},axis=1)
df20=df20.iloc[0:9]
df20

           Player Name
0         Lizelle Lee
1        Alyssa Healy
2     Stafanie Taylor
3         Meg Lanning
4   Amy Satterthwaite
5     Smriti Mandhana
6         Mithali Raj
7      Natalie Sciver
8     Laura Wolvaardt

In [72]:
for i in team1:
    Team1.append(i.text)
Team1

['\n\nSA\n',
 '\n\nAUS\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nAUS\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSL\n',
 '\n\nBAN\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nSL\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nBAN\n',
 '\n\nSL\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nAUS\n',
 '\n\nBAN\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nENG\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nAUS\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSL\n',
 '\n\nBAN\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nPAK\n',
 '\n\nSL\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nENG\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nBAN\n',
 '\n\nSL\n']

In [73]:
df21=pd.DataFrame(Team1)
df21[0]=df21[0].str.replace('\n',' ')
df21=df21.rename({0:'Team'},axis=1)
df21=df21.iloc[0:9]
df21

     Team
0     SA
1    AUS
2     WI
3    AUS
4     NZ
5    IND
6    IND
7    ENG
8     SA

In [74]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['758',
 '756',
 '746',
 '723',
 '715',
 '710',
 '709',
 '685',
 '683',
 '679',
 '667',
 '666',
 '657',
 '636',
 '620',
 '600',
 '593',
 '577',
 '573',
 '568',
 '560',
 '560',
 '536',
 '536',
 '520',
 '498',
 '461',
 '456',
 '445',
 '440',
 '437',
 '437',
 '413',
 '410',
 '404',
 '398',
 '396',
 '380',
 '361',
 '360',
 '359',
 '357',
 '353',
 '350',
 '341',
 '337',
 '335',
 '320',
 '319',
 '319',
 '317',
 '310',
 '305',
 '305',
 '302',
 '294',
 '292',
 '285',
 '281',
 '276',
 '264',
 '264',
 '261',
 '259',
 '256',
 '252',
 '244',
 '240',
 '239',
 '236',
 '234',
 '234',
 '226',
 '225',
 '224',
 '221',
 '220',
 '219',
 '211',
 '208',
 '205',
 '204',
 '201',
 '195',
 '195',
 '192',
 '190',
 '188',
 '186',
 '181',
 '179',
 '179',
 '178',
 '175',
 '172',
 '170',
 '168',
 '166',
 '161']

In [75]:
df22=pd.DataFrame(Rating1)
df22=df22.rename({0:'Rating'},axis=1)
df22=df22.iloc[0:9]
df22

  Rating
0    758
1    756
2    746
3    723
4    715
5    710
6    709
7    685
8    683

In [76]:
player1=pd.concat([df20,df21,df22],axis=1)
player1

           Player Name    Team Rating
0         Lizelle Lee      SA     758
1        Alyssa Healy     AUS     756
2     Stafanie Taylor      WI     746
3         Meg Lanning     AUS     723
4   Amy Satterthwaite      NZ     715
5     Smriti Mandhana     IND     710
6         Mithali Raj     IND     709
7      Natalie Sciver     ENG     685
8     Laura Wolvaardt      SA     683

In [77]:
All_Rounder=pd.concat([player,player1],axis=0)
All_Rounder.index=range(10)
All_Rounder

           Player Name                        Team Rating
0       Tammy Beaumont    ENG                         765
1         Lizelle Lee                          SA     758
2        Alyssa Healy                         AUS     756
3     Stafanie Taylor                          WI     746
4         Meg Lanning                         AUS     723
5   Amy Satterthwaite                          NZ     715
6     Smriti Mandhana                         IND     710
7         Mithali Raj                         IND     709
8      Natalie Sciver                         ENG     685
9     Laura Wolvaardt                          SA     683